default
@初期設定
    &カード名,エイルフィリア //脊髄から出た名前です
    &カード画像,EU01_soldato.png
    &立ち絵ズーム,EU01_soldato_zoom.png

@戦闘
    攻撃タイプランダム変更,剣,剣,魔法 //function 攻撃タイプランダム変更(array){context['攻撃タイプ'] = arraySelect(array)}
    if,攻撃タイプ,==,剣 //if(context['攻撃タイプ'] == '剣')
    {
        乱数生成,1,4 //function 乱数生成(min,max){context['乱数'] = Math.floor(Math.random() * (max - min + 1) + min)}
        &攻撃時乱数,=,乱数 //context['攻撃時乱数'] = context['乱数']
        if,乱数,==,1
        {
            セリフ,私の一撃を喰らいなさい //async function セリフ(str){await addtext(str);}
            セリフ,この程度で倒れないでくださいね？
        }
        if,乱数,==,2
        {
            セリフ,あなたの覚悟、試させていただきます
            セリフ,次は……もう少し防いでみてくださいね
        }
        if,乱数,==,3
        {
            セリフ,速さこそ、優雅さ……そうは思いませんか？
            セリフ,まぁ、答えなんて聞いていませんが
        }
        if,乱数,==,4
        {
            セリフ,力任せではなく、心で斬りなさい。
            セリフ,...できるなら、の話ですが
        }
    }
    if,攻撃タイプ,==,魔法 //雷を操ってどーんって落とすイメージ 攻撃時確率で麻痺を付与
    {
        乱数生成,1,3
        &攻撃時乱数,=,乱数
        if,乱数,==,1
        {
            セリフ,裁きを受けなさい
            セリフ,静電の囁き、貴方には届かないかしら？
        }
        if(,乱数,==,2)
        {
            セリフ,雷よ、彼の愚鈍なる足を責め立てて
            セリフ,ほら、逃げれるものなら逃げてごらんなさい？
            状態異常付与,相手,麻痺
        }
        if(,乱数,==,3)
        {
            セリフ,速さこそ、優雅さ……そうは思いませんか？
            セリフ,..なーんて、ね
            セリフ,奇襲、それこそ最も優雅でしょう？
            状態異常付与,相手,麻痺
        }
        //ほらほら、逃げないと死んじゃうわよ〜ん笑笑 はやめました さすがに
    }

//魔法で麻痺とかつけて、その後に呼ばれるやつ
//そう考えると、この人は雷を操りし剣士、って感じ？ いいね、すごく好き
@弱点攻撃
    if,相手状態異常,==,麻痺
    {
        イベント実行,溜め攻撃 //function イベント実行(name){} //@${name} に飛ぶ...って関数にしたい
                 //↑は何かバーが出てきて、zかxを連打して、逃れないと大ダメージ....って感じのイベント..どう？
    }

@溜め攻撃
//スーパーウルトラダイナミックボルケーノ未定
//そもqteすらあまりよくわかってないからね我 バー出して〜とか無理よ、わしには あとセリフも考えれないし
//までも2つバー出して、上は結構高速で勝手に溜まってって、下は連打で溜まってく、上が先にmaxになったら失敗、って感じならできそう
